app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "osora"], ["email", "osorabrian@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-22 08:21:37.996014"], ["updated_at", "2023-03-22 08:21:37.996014"]]
---
    def register_user
        user = User.create(user_params)